///  <<<<<<<<<<<<<<<<<<<<<<<<--内存增长方向--<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
///                    ---------------------------
///       小端         |   Adr + 1   |     Adr   |
///                    ---------------------------
///                    --------------------------- 小端或者大端表示多个字
///                    |MSB    16 bit value  LSB | 节值的哪一端(大端或者小端)
///                    --------------------------- 储存在该值的起始位置
///                    ---------------------------
///       大端         |    Adr   |     Adr + 1  |
///                    ---------------------------
///  >>>>>>>>>>>>>>>>>>>>>>>>>--内存增长方向-->>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
#include <iostream>
#include <iomanip>

int main(int argc, char **argv)
{
    int a = 0x01020304;
    char *ptr = (char *)(&a);
    for (std::size_t i = 0; i < sizeof(a); i++)
    {
        std::cout << "addr = [0x" << static_cast<const void *>(ptr + i) << "], value = [0x"
        << std::setfill('0') << std::setw(2) << static_cast<int>(*(ptr + i)) << "]" << std::endl;
	}

  return 0;
}
