/************************************************************//*
 * 测试继承中析构函数调用的顺序
 **************************************************************/
#include <iostream>
class X
{
public:
	~X ()
	{
		std::cout << "X::X() destructor invoked!" << std::endl;
	}
};

class Y : public X
{
public:
	~Y ()
	{
		std::cout << "Y::Y() destructor invoked!" << std::endl;
	}
};

int main()
{
	Y y;
}
/********************************************//*
* 先调用派生类的析构函数, 再调用基类的析构函数						
**********************************************/
